
/*==============================================================================
player.h　プレイヤーヘッダー
Author　　GP-11A-243 (40) LIU HAIJIAN
==============================================================================*/

#ifndef _PLAYER_H_
#define _PLAYER_H_

/*==============================================================================
インクルードファイル
==============================================================================*/
#include "level.h"

/*==============================================================================
構造体定義
==============================================================================*/
typedef struct {
	int x, y, move, color, counter, superCounter;
	bool super, alive;
	wchar_t maker[2];
} Player;

/*==============================================================================
プロトタイプ宣言
==============================================================================*/
Player initPlayer();
void movePlayer(Player* player, wchar_t* level, GameStatus* gameStatus);
void updatePlayer(Player* player, wchar_t* level, GameStatus* gameStatus);

#endif
