
/*==============================================================================
title.h　タイトルヘッダー
Author　GP-11A-243 (40) LIU HAIJIAN
==============================================================================*/

#ifndef _TITLE_H_
#define _TITLE_H_

/*==============================================================================
インクルードファイル
==============================================================================*/
#include "level.h"

/*==============================================================================
マクロ定義
==============================================================================*/
// 座標
#define TITLE_SIZE_X  (28) // タイトルの大きさ
#define TITLE_SIZE_Y  (9)  // タイトルの大きさ
#define TITLE_COORD_X (6)  // タイトルの座標
#define TITLE_COORD_Y (6)  // タイトルの座標
#define TEXT_COORD_X  (10) // 難易度の座標
#define TEXT_COORD_Y  (17) // 難易度の座標

/*==============================================================================
プロトタイプ宣言
==============================================================================*/
void drawTutorial();
void initTitle(wchar_t* titleText);
void updateTitle(wchar_t* titleText, GameStatus* gameStatus);

#endif
